team/case8/C_dbl/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          41;
        startFace       46742;
    }
    outlet
    {
        type            patch;
        nFaces          78;
        startFace       46783;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          314;
        startFace       46861;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          351;
        startFace       47175;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          47134;
        startFace       47526;
    }
)

// ************************************************************************* //
