team/case8/C_dbl/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 314.4;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 314.4;
    }
    outlet
    {
        type            zeroGradient;
    }

    upperWall
    {
        type            omegaWallFunction;
        value           uniform 0;
    }

    lowerWall
    {
        type            omegaWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
